modul7/app/Controllers/BukuController.php

SELECT *
FROM `buku`
---
    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/loginView')->with('error', 'Silakan login terlebih dahulu.');
        }

        $model = new BukuModel();
        $data['buku'] = $model->findAll();

INSERT INTO `buku` (`judul`, `pengarang`, `penerbit`, `tahun_terbit`) VALUES ('jujur kasian', 'Tite Kubo', 'nagi sheisiro', '2020')
---
    public function store()
    {
        $validationRules = [
            'judul' => 'required|regex_match[/^[a-zA-Z\s]+$/]',
            'pengarang' => 'required|regex_match[/^[a-zA-Z\s]+$/]',
            'penerbit' => 'required|regex_match[/^[a-zA-Z\s]+$/]',
            'tahun_terbit' => 'required|numeric|greater_than[1900]|less_than[2024]'
        ];

        if (!$this->validate($validationRules)) {
            return redirect()->back()->withInput()->with('validation', $this->validator);
        }

        $model = new BukuModel();
        $model->save([
            'judul' => $this->request->getPost('judul'),
            'pengarang' => $this->request->getPost('pengarang'),
            'penerbit' => $this->request->getPost('penerbit'),
            'tahun_terbit' => $this->request->getPost('tahun_terbit'),
        ]);

SELECT *
FROM `buku`
WHERE `buku`.`id` = '6'
---
    public function edit($id)
    {
        $model = new BukuModel();
        $buku = $model->find($id);

SELECT *
FROM `buku`
WHERE `buku`.`id` = '5'
DELETE FROM `buku`
WHERE `id` IN ('5')
---
    public function delete($id)
    {
        $model = new BukuModel();
        $buku = $model->find($id);

        if (!$buku) {
            return redirect()->to('/buku')->with('error', 'Data buku tidak ditemukan.');
        }

        $model->delete($id);